{
  "count": 1,
  "items": [
    {
      "id": "hprc.in_8cdd2a04ff",
      "url": "https://hprc.in",
      "title": "HYDERABAD POLO AND RIDING CLUB - Home",
      "timestamp": 1758635991,
      "text": "HYDERABAD POLO AND RIDING CLUB - Home +91 – 9177 00 00 56 info@hprc.co.in Member Login Pay Now toggle navigation Home About us Who We Are Mission Vision Values Managing Committee Start Riding About Riding Packages Beginners Riding Programme Intermediate Riding Programme Advanced Riding Programme Polo Equestrian Polo About Polo Stick & Ball Chukkers Events Past Events Upcoming Events SPORTS CENTRE Tennis Badminton Squash Swimming pool Basketball Futsal Gym Sauna Upcoming SportS Event Packages Gold Package Platinum Package RESTAURANTS Chukkers Snaffles Bistro BANQUETS Membership Events & Media Photo Gallery Video Gallery News Events Newsletters Blogs Contact Us Witness the splendour of International Polo Arena Championships Explore Event Reap the joy and benefits of Horse Riding Explore Experience the thrill and magnificence of Polo Explore Train at our state-of-the-art Sports Facilities Explore Lose yourself to the exquisite cuisine and royal ambience Explore Witness the splendour of International Polo Arena Championships Explore Event Reap the joy and benefits of Horse Riding Explore Welcome To HPRC Established in 2005, the Hyderabad Polo & Riding Club (HPRC) aims to promote polo and other equestrian activities in the vibrant city of Hyderabad. In its first decade, HPRC has achieved notable success, winning prestigious tournaments such as the Royal Western Mumbai and the Indian Open Championship. Beyond participating in polo tournaments nationwide, HPRC hosts the National Polo Season annually in Hyderabad, attracting teams from across the country. HPRC is more than just a polo club; it features a top-notch sports centre that offers diverse events and activities for enthusiasts of all ages. Our dining facilities provide a gourmet experience, perfect for relaxing after a day of riding. Additionally, we are excited to announce the upcoming addition of luxurious rooms, offering a complete and immersive experience for our members and guests. Read More Majestic Surroundings and Leisure - All in One Place. Enter the exciting world of Hyderabad Polo & Riding Club, where prestigious equestrian sports meet state-of-the-art infrastructure. Our modern, fully-equipped equestrian centre offers everything from polo and show-jumping to horse riding. Enhance your riding skills or simply unwind in our relaxed atmosphere with a refreshing beverage at our dining facilities. Soon, you will be able to extend your stay at HPRC luxurious rooms. Soak in the majestic surroundings and enjoy time with friends and family, all in one extraordinary place that blends sport and leisure seamlessly. Energise your mind, body, and soul with a visit to our spacious and accommodating club, which has quickly become the hub of Hyderabad for equestrian pursuits and leisure activities. BECOME A MEMBER Your browser does not support HTML video. A wide range of events for everyone Learn Riding HPRC conducts a various training events in riding for members of all age groups in order to help you excel at the sport. Read More Weekend Getaway We are coming up with Rooms very soon, that may be booked by our members and their guests for the perfect weekend getaways. Read More Banquet Hall Elegantly designed to provide a luxurious setting and impeccable service for your special occasions. Perfect for hosting weddings, corporate events and social gatherings. Read More Polo Lose yourself in the glamorous world of polo at the exclusive Hyderabad Polo & Riding Club. Even complete novices are given the strong foundations to excel. Read More SPORTS CENTER HPRC has many options for a sports enthusiast to stay engaged. Besides Polo, equestrian and riding facilities we offer Basketball, Tennis, Squash, Badminton, Swimming and Futsal. Read More RESTAURANTS HPRC features two exquisite dining options where members can enjoy a culinary experience. Elegant dining experience at Chukkers and a more relaxed & casual atmosphere at Snaffles Bistro, both offering delicious cuisines. Read More News HPRC joins hands with Academia Sports Village HPRC is now conducting Tennis, Football and Basketball training with international coaches in partnership with Sports Village. Read More EVENTS & Results TSEA - 2nd Regional Equestrian League Organised By Telangana State Equestrian Association (TSEA). In Association with Hyderabad Polo and Riding Club (HPRC).. Read More Blogs Health Benefits of Horse Riding That You Did Not Know Horse riding is an enjoyable hobby and sport for adults and children alike. Learning to control and care ... Read More Explore Home About Us Membership Login Start Riding Polo News & Events Contact Us Quick links Apply for Membership Pay Now e-Brochure Past Events Facilities Sport Center Restaurants Banquets Address Near Mrugavani Resort and Spa, Aziz Nagar Village, Gandipet, Ranga Reddy District, Hyderabad, Telangana, India - 500075 reaz@hprc.co.in +91 9177000056 View Location On Map Gallery © 2005 – 2024. HYDERABAD POLO & RIDING CLUB. All Rights Reserved Terms and Conditions | Privacy Policy",
      "links": [
        "https://hprc.in/index.html",
        "https://hprc.in/Membership_Login.html",
        "https://hprc.in/pay-now.html",
        "https://hprc.in/index.html",
        "https://hprc.in/who-we-are.html",
        "https://hprc.in/mission_vision_values.html",
        "https://hprc.in/managing-committee.html",
        "https://hprc.in/About_Riding.html",
        "https://hprc.in/Beginners_Riding_Programme.html",
        "https://hprc.in/Intermediate_Riding_Programme.html",
        "https://hprc.in/Polo.html",
        "https://hprc.in/equestrian.html",
        "https://hprc.in/about_polo.html",
        "https://hprc.in/Stick_&_Ball.html",
        "https://hprc.in/Chukkers.html",
        "https://hprc.in/Past_Events.html",
        "https://hprc.in/Upcoming_Events.html",
        "https://hprc.in/tennis.html",
        "https://hprc.in/badminton.html",
        "https://hprc.in/squash.html",
        "https://hprc.in/swimming.html",
        "https://hprc.in/basketball.html",
        "https://hprc.in/futsal.html",
        "https://hprc.in/gym.html",
        "https://hprc.in/Sauna.html",
        "https://hprc.in/Upcoming_Sports_Event.html",
        "https://hprc.in/Gold_Package.html",
        "https://hprc.in/Platnium_Package.html",
        "https://hprc.in/Restaurant_Chukkers.html",
        "https://hprc.in/snaffles_bistro.html",
        "https://hprc.in/banquets.html",
        "https://hprc.in/apply-for-membership.html",
        "https://hprc.in/photo-gallery.html",
        "https://hprc.in/video-gallery.html",
        "https://hprc.in/news.html",
        "https://hprc.in/events.html",
        "https://hprc.in/newsletters.html",
        "https://hprc.in/blogs.html",
        "https://hprc.in/contact-us.html",
        "https://hprc.in/Past_Events.html",
        "https://hprc.in/Beginners_Riding_Programme.html",
        "https://hprc.in/about_polo.html",
        "https://hprc.in/gym.html",
        "https://hprc.in/Restaurant_Chukkers.html",
        "https://hprc.in/Past_Events.html",
        "https://hprc.in/Beginners_Riding_Programme.html",
        "https://hprc.in/who-we-are.html",
        "https://hprc.in/apply-for-membership.html",
        "https://hprc.in/Beginners_Riding_Programme.html",
        "https://hprc.in/luxury_rooms.html",
        "https://hprc.in/banquets.html",
        "https://hprc.in/about_polo.html",
        "https://hprc.in/swimming.html",
        "https://hprc.in/snaffles_bistro.html",
        "https://hprc.in/News-HPRC-joins-hands-with-Sports-Village.html",
        "https://hprc.in/News-HPRC-joins-hands-with-Sports-Village.html",
        "https://hprc.in/2nd-rel-tsea.html",
        "https://hprc.in/2nd-rel-tsea.html",
        "https://hprc.in/health-benefits-horse-riding-not-know.html",
        "https://hprc.in/health-benefits-horse-riding-not-know.html",
        "https://hprc.in/index.html",
        "https://www.facebook.com/hydprc",
        "https://x.com/i/flow/login?redirect_after_login=%2Fhydpolorc",
        "https://www.youtube.com/channel/UC40silYJ07LvOjP4bnuRTqg",
        "https://www.instagram.com/hydprc?igsh=aWtteGJhOHU2Mmxl",
        "https://hprc.in/index.html",
        "https://hprc.in/who-we-are.html",
        "https://hprc.in/Membership_Login.html",
        "https://hprc.in/About_Riding.html",
        "https://hprc.in/about_polo.html",
        "https://hprc.in/news.html",
        "https://hprc.in/contact-us.html",
        "https://hprc.in/apply-for-membership.html",
        "https://hprc.in/pay-now.html",
        "https://hprc.in/Past_Events.html",
        "https://hprc.in/gym.html",
        "https://hprc.in/Restaurant_Chukkers.html",
        "https://hprc.in/banquets.html",
        "https://www.google.com/maps?ll=17.352588,78.339242&z=15&t=m&hl=en-US&gl=IN&mapclient=embed&cid=8606793467653630286",
        "https://hprc.in/photo-gallery.html"
      ]
    }
  ]
}